<net name="deploy_model_algo_1" version="2" batch="1">
  <layers>
    <layer name="data" type="Input" id="1" precision="FP32">
      <output>
        <port id="1">
          <dim>1</dim>
          <dim>3</dim>
          <dim>300</dim>
          <dim>300</dim>
        </port>
      </output>
    </layer>
    <layer name="ScaleShift_bn_data" type="ScaleShift" id="2" precision="FP32">
      <input>
        <port id="3">
          <dim>1</dim>
          <dim>3</dim>
          <dim>300</dim>
          <dim>300</dim>
        </port>
      </input>
      <output>
        <port id="2">
          <dim>1</dim>
          <dim>3</dim>
          <dim>300</dim>
          <dim>300</dim>
        </port>
      </output>
      <weights size="12" offset="0"/>
      <biases size="12" offset="12"/>
    </layer>
    <layer name="Convolution_conv0" type="Convolution" id="3" precision="FP32">
      <convolution_data stride-x="2" stride-y="2" pad-x="3" pad-y="3" kernel-x="7" kernel-y="7" output="64" group="1" dilation-x="1" dilation-y="1"/>
      <input>
        <port id="5">
          <dim>1</dim>
          <dim>3</dim>
          <dim>300</dim>
          <dim>300</dim>
        </port>
      </input>
      <output>
        <port id="4">
          <dim>1</dim>
          <dim>64</dim>
          <dim>150</dim>
          <dim>150</dim>
        </port>
      </output>
      <weights size="37632" offset="24"/>
      <biases size="256" offset="37656"/>
    </layer>
    <layer name="ReLU_relu0" type="ReLU" id="4" precision="FP32">
      <input>
        <port id="7">
          <dim>1</dim>
          <dim>64</dim>
          <dim>150</dim>
          <dim>150</dim>
        </port>
      </input>
      <output>
        <port id="6">
          <dim>1</dim>
          <dim>64</dim>
          <dim>150</dim>
          <dim>150</dim>
        </port>
      </output>
    </layer>
    <layer name="Pooling_pooling0" type="Pooling" id="5" precision="FP32">
      <pooling_data stride-x="2" stride-y="2" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" rounding-type="ceil" pool-method="max"/>
      <input>
        <port id="9">
          <dim>1</dim>
          <dim>64</dim>
          <dim>150</dim>
          <dim>150</dim>
        </port>
      </input>
      <output>
        <port id="8">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer name="ScaleShift_stage1_unit1_bn1" type="ScaleShift" id="6" precision="FP32">
      <input>
        <port id="11">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="10">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights size="256" offset="37912"/>
      <biases size="256" offset="38168"/>
    </layer>
    <layer name="ReLU_stage1_unit1_relu1" type="ReLU" id="7" precision="FP32">
      <input>
        <port id="13">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="12">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage1_unit1_conv1" type="Convolution" id="8" precision="FP32">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="64" group="1" dilation-x="1" dilation-y="1"/>
      <input>
        <port id="15">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="14">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights size="16384" offset="38424"/>
      <biases size="256" offset="54808"/>
    </layer>
    <layer name="ReLU_stage1_unit1_relu2" type="ReLU" id="9" precision="FP32">
      <input>
        <port id="17">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="16">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage1_unit1_conv2" type="Convolution" id="10" precision="FP32">
      <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="64" group="1" dilation-x="1" dilation-y="1"/>
      <input>
        <port id="19">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="18">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights size="147456" offset="55064"/>
      <biases size="256" offset="202520"/>
    </layer>
    <layer name="ReLU_stage1_unit1_relu3" type="ReLU" id="11" precision="FP32">
      <input>
        <port id="21">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="20">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage1_unit1_conv3" type="Convolution" id="12" precision="FP32">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="256" group="1" dilation-x="1" dilation-y="1"/>
      <input>
        <port id="23">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="22">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights size="65536" offset="202776"/>
    </layer>
    <layer name="Convolution_stage1_unit1_sc" type="Convolution" id="13" precision="FP32">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="256" group="1" dilation-x="1" dilation-y="1"/>
      <input>
        <port id="25">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="24">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights size="65536" offset="268312"/>
    </layer>
    <layer name="Eltwise__plus0" type="Eltwise" id="14" precision="FP32">
      <elementwise_data operation="sum"/>
      <input>
        <port id="27">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
        <port id="28">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="26">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer name="ScaleShift_stage1_unit2_bn1" type="ScaleShift" id="15" precision="FP32">
      <input>
        <port id="30">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="29">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights size="1024" offset="333848"/>
      <biases size="1024" offset="334872"/>
    </layer>
    <layer name="ReLU_stage1_unit2_relu1" type="ReLU" id="16" precision="FP32">
      <input>
        <port id="32">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="31">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage1_unit2_conv1" type="Convolution" id="17" precision="FP32">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="64" group="1" dilation-x="1" dilation-y="1"/>
      <input>
        <port id="34">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="33">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights size="65536" offset="335896"/>
      <biases size="256" offset="401432"/>
    </layer>
    <layer name="ReLU_stage1_unit2_relu2" type="ReLU" id="18" precision="FP32">
      <input>
        <port id="36">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="35">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage1_unit2_conv2" type="Convolution" id="19" precision="FP32">
      <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="64" group="1" dilation-x="1" dilation-y="1"/>
      <input>
        <port id="38">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="37">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights size="147456" offset="401688"/>
      <biases size="256" offset="549144"/>
    </layer>
    <layer name="ReLU_stage1_unit2_relu3" type="ReLU" id="20" precision="FP32">
      <input>
        <port id="40">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="39">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage1_unit2_conv3" type="Convolution" id="21" precision="FP32">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="256" group="1" dilation-x="1" dilation-y="1"/>
      <input>
        <port id="42">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="41">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights size="65536" offset="549400"/>
    </layer>
    <layer name="Eltwise__plus1" type="Eltwise" id="22" precision="FP32">
      <elementwise_data operation="sum"/>
      <input>
        <port id="44">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
        <port id="45">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="43">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer name="ScaleShift_stage1_unit3_bn1" type="ScaleShift" id="23" precision="FP32">
      <input>
        <port id="47">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="46">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights size="1024" offset="614936"/>
      <biases size="1024" offset="615960"/>
    </layer>
    <layer name="ReLU_stage1_unit3_relu1" type="ReLU" id="24" precision="FP32">
      <input>
        <port id="49">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="48">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage1_unit3_conv1" type="Convolution" id="25" precision="FP32">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="64" group="1" dilation-x="1" dilation-y="1"/>
      <input>
        <port id="51">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="50">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights size="65536" offset="616984"/>
      <biases size="256" offset="682520"/>
    </layer>
    <layer name="ReLU_stage1_unit3_relu2" type="ReLU" id="26" precision="FP32">
      <input>
        <port id="53">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="52">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage1_unit3_conv2" type="Convolution" id="27" precision="FP32">
      <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="64" group="1" dilation-x="1" dilation-y="1"/>
      <input>
        <port id="55">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="54">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights size="147456" offset="682776"/>
      <biases size="256" offset="830232"/>
    </layer>
    <layer name="ReLU_stage1_unit3_relu3" type="ReLU" id="28" precision="FP32">
      <input>
        <port id="57">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="56">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage1_unit3_conv3" type="Convolution" id="29" precision="FP32">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="256" group="1" dilation-x="1" dilation-y="1"/>
      <input>
        <port id="59">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="58">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights size="65536" offset="830488"/>
    </layer>
    <layer name="Eltwise__plus2" type="Eltwise" id="30" precision="FP32">
      <elementwise_data operation="sum"/>
      <input>
        <port id="61">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
        <port id="62">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="60">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer name="ScaleShift_stage2_unit1_bn1" type="ScaleShift" id="31" precision="FP32">
      <input>
        <port id="64">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="63">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights size="1024" offset="896024"/>
      <biases size="1024" offset="897048"/>
    </layer>
    <layer name="ReLU_stage2_unit1_relu1" type="ReLU" id="32" precision="FP32">
      <input>
        <port id="66">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="65">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage2_unit1_conv1" type="Convolution" id="33" precision="FP32">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="128" group="1" dilation-x="1" dilation-y="1"/>
      <input>
        <port id="68">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="67">
          <dim>1</dim>
          <dim>128</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights size="131072" offset="898072"/>
      <biases size="512" offset="1029144"/>
    </layer>
    <layer name="ReLU_stage2_unit1_relu2" type="ReLU" id="34" precision="FP32">
      <input>
        <port id="70">
          <dim>1</dim>
          <dim>128</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="69">
          <dim>1</dim>
          <dim>128</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage2_unit1_conv2" type="Convolution" id="35" precision="FP32">
      <convolution_data stride-x="2" stride-y="2" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="128" group="1" dilation-x="1" dilation-y="1"/>
      <input>
        <port id="72">
          <dim>1</dim>
          <dim>128</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="71">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights size="589824" offset="1029656"/>
      <biases size="512" offset="1619480"/>
    </layer>
    <layer name="ReLU_stage2_unit1_relu3" type="ReLU" id="36" precision="FP32">
      <input>
        <port id="74">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="73">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage2_unit1_conv3" type="Convolution" id="37" precision="FP32">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="512" group="1" dilation-x="1" dilation-y="1"/>
      <input>
        <port id="76">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="75">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights size="262144" offset="1619992"/>
    </layer>
    <layer name="Convolution_stage2_unit1_sc" type="Convolution" id="38" precision="FP32">
      <convolution_data stride-x="2" stride-y="2" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="512" group="1" dilation-x="1" dilation-y="1"/>
      <input>
        <port id="78">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="77">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights size="524288" offset="1882136"/>
    </layer>
    <layer name="Eltwise__plus3" type="Eltwise" id="39" precision="FP32">
      <elementwise_data operation="sum"/>
      <input>
        <port id="80">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
        <port id="81">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="79">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer name="ScaleShift_stage2_unit2_bn1" type="ScaleShift" id="40" precision="FP32">
      <input>
        <port id="83">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="82">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights size="2048" offset="2406424"/>
      <biases size="2048" offset="2408472"/>
    </layer>
    <layer name="ReLU_stage2_unit2_relu1" type="ReLU" id="41" precision="FP32">
      <input>
        <port id="85">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="84">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage2_unit2_conv1" type="Convolution" id="42" precision="FP32">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="128" group="1" dilation-x="1" dilation-y="1"/>
      <input>
        <port id="87">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="86">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights size="262144" offset="2410520"/>
      <biases size="512" offset="2672664"/>
    </layer>
    <layer name="ReLU_stage2_unit2_relu2" type="ReLU" id="43" precision="FP32">
      <input>
        <port id="89">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="88">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage2_unit2_conv2" type="Convolution" id="44" precision="FP32">
      <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="128" group="1" dilation-x="1" dilation-y="1"/>
      <input>
        <port id="91">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="90">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights size="589824" offset="2673176"/>
      <biases size="512" offset="3263000"/>
    </layer>
    <layer name="ReLU_stage2_unit2_relu3" type="ReLU" id="45" precision="FP32">
      <input>
        <port id="93">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="92">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage2_unit2_conv3" type="Convolution" id="46" precision="FP32">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="512" group="1" dilation-x="1" dilation-y="1"/>
      <input>
        <port id="95">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="94">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights size="262144" offset="3263512"/>
    </layer>
    <layer name="Eltwise__plus4" type="Eltwise" id="47" precision="FP32">
      <elementwise_data operation="sum"/>
      <input>
        <port id="97">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
        <port id="98">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="96">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer name="ScaleShift_stage2_unit3_bn1" type="ScaleShift" id="48" precision="FP32">
      <input>
        <port id="100">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="99">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights size="2048" offset="3525656"/>
      <biases size="2048" offset="3527704"/>
    </layer>
    <layer name="ReLU_stage2_unit3_relu1" type="ReLU" id="49" precision="FP32">
      <input>
        <port id="102">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="101">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage2_unit3_conv1" type="Convolution" id="50" precision="FP32">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="128" group="1" dilation-x="1" dilation-y="1"/>
      <input>
        <port id="104">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="103">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights size="262144" offset="3529752"/>
      <biases size="512" offset="3791896"/>
    </layer>
    <layer name="ReLU_stage2_unit3_relu2" type="ReLU" id="51" precision="FP32">
      <input>
        <port id="106">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="105">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage2_unit3_conv2" type="Convolution" id="52" precision="FP32">
      <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="128" group="1" dilation-x="1" dilation-y="1"/>
      <input>
        <port id="108">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="107">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights size="589824" offset="3792408"/>
      <biases size="512" offset="4382232"/>
    </layer>
    <layer name="ReLU_stage2_unit3_relu3" type="ReLU" id="53" precision="FP32">
      <input>
        <port id="110">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="109">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage2_unit3_conv3" type="Convolution" id="54" precision="FP32">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="512" group="1" dilation-x="1" dilation-y="1"/>
      <input>
        <port id="112">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="111">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights size="262144" offset="4382744"/>
    </layer>
    <layer name="Eltwise__plus5" type="Eltwise" id="55" precision="FP32">
      <elementwise_data operation="sum"/>
      <input>
        <port id="114">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
        <port id="115">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="113">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer name="ScaleShift_stage2_unit4_bn1" type="ScaleShift" id="56" precision="FP32">
      <input>
        <port id="117">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="116">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights size="2048" offset="4644888"/>
      <biases size="2048" offset="4646936"/>
    </layer>
    <layer name="ReLU_stage2_unit4_relu1" type="ReLU" id="57" precision="FP32">
      <input>
        <port id="119">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="118">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage2_unit4_conv1" type="Convolution" id="58" precision="FP32">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="128" group="1" dilation-x="1" dilation-y="1"/>
      <input>
        <port id="121">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="120">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights size="262144" offset="4648984"/>
      <biases size="512" offset="4911128"/>
    </layer>
    <layer name="ReLU_stage2_unit4_relu2" type="ReLU" id="59" precision="FP32">
      <input>
        <port id="123">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="122">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage2_unit4_conv2" type="Convolution" id="60" precision="FP32">
      <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="128" group="1" dilation-x="1" dilation-y="1"/>
      <input>
        <port id="125">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="124">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights size="589824" offset="4911640"/>
      <biases size="512" offset="5501464"/>
    </layer>
    <layer name="ReLU_stage2_unit4_relu3" type="ReLU" id="61" precision="FP32">
      <input>
        <port id="127">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="126">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage2_unit4_conv3" type="Convolution" id="62" precision="FP32">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="512" group="1" dilation-x="1" dilation-y="1"/>
      <input>
        <port id="129">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="128">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights size="262144" offset="5501976"/>
    </layer>
    <layer name="Eltwise__plus6" type="Eltwise" id="63" precision="FP32">
      <elementwise_data operation="sum"/>
      <input>
        <port id="131">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
        <port id="132">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="130">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer name="ScaleShift_stage3_unit1_bn1" type="ScaleShift" id="64" precision="FP32">
      <input>
        <port id="134">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="133">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights size="2048" offset="5764120"/>
      <biases size="2048" offset="5766168"/>
    </layer>
    <layer name="ReLU_stage3_unit1_relu1" type="ReLU" id="65" precision="FP32">
      <input>
        <port id="136">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="135">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage3_unit1_conv1" type="Convolution" id="66" precision="FP32">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="256" group="1" dilation-x="1" dilation-y="1"/>
      <input>
        <port id="138">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="137">
          <dim>1</dim>
          <dim>256</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights size="524288" offset="5768216"/>
      <biases size="1024" offset="6292504"/>
    </layer>
    <layer name="ReLU_stage3_unit1_relu2" type="ReLU" id="67" precision="FP32">
      <input>
        <port id="140">
          <dim>1</dim>
          <dim>256</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="139">
          <dim>1</dim>
          <dim>256</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage3_unit1_conv2" type="Convolution" id="68" precision="FP32">
      <convolution_data stride-x="2" stride-y="2" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="256" group="1" dilation-x="1" dilation-y="1"/>
      <input>
        <port id="142">
          <dim>1</dim>
          <dim>256</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="141">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights size="2359296" offset="6293528"/>
      <biases size="1024" offset="8652824"/>
    </layer>
    <layer name="ReLU_stage3_unit1_relu3" type="ReLU" id="69" precision="FP32">
      <input>
        <port id="144">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="143">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage3_unit1_conv3" type="Convolution" id="70" precision="FP32">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="1024" group="1" dilation-x="1" dilation-y="1"/>
      <input>
        <port id="146">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="145">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights size="1048576" offset="8653848"/>
    </layer>
    <layer name="Convolution_stage3_unit1_sc" type="Convolution" id="71" precision="FP32">
      <convolution_data stride-x="2" stride-y="2" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="1024" group="1" dilation-x="1" dilation-y="1"/>
      <input>
        <port id="148">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="147">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights size="2097152" offset="9702424"/>
    </layer>
    <layer name="Eltwise__plus7" type="Eltwise" id="72" precision="FP32">
      <elementwise_data operation="sum"/>
      <input>
        <port id="150">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
        <port id="151">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="149">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
    </layer>
    <layer name="ScaleShift_stage3_unit2_bn1" type="ScaleShift" id="73" precision="FP32">
      <input>
        <port id="153">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="152">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights size="4096" offset="11799576"/>
      <biases size="4096" offset="11803672"/>
    </layer>
    <layer name="ReLU_stage3_unit2_relu1" type="ReLU" id="74" precision="FP32">
      <input>
        <port id="155">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="154">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage3_unit2_conv1" type="Convolution" id="75" precision="FP32">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="256" group="1" dilation-x="1" dilation-y="1"/>
      <input>
        <port id="157">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="156">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights size="1048576" offset="11807768"/>
      <biases size="1024" offset="12856344"/>
    </layer>
    <layer name="ReLU_stage3_unit2_relu2" type="ReLU" id="76" precision="FP32">
      <input>
        <port id="159">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="158">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage3_unit2_conv2" type="Convolution" id="77" precision="FP32">
      <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="256" group="1" dilation-x="1" dilation-y="1"/>
      <input>
        <port id="161">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="160">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights size="2359296" offset="12857368"/>
      <biases size="1024" offset="15216664"/>
    </layer>
    <layer name="ReLU_stage3_unit2_relu3" type="ReLU" id="78" precision="FP32">
      <input>
        <port id="163">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="162">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage3_unit2_conv3" type="Convolution" id="79" precision="FP32">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="1024" group="1" dilation-x="1" dilation-y="1"/>
      <input>
        <port id="165">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="164">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights size="1048576" offset="15217688"/>
    </layer>
    <layer name="Eltwise__plus8" type="Eltwise" id="80" precision="FP32">
      <elementwise_data operation="sum"/>
      <input>
        <port id="167">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
        <port id="168">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="166">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
    </layer>
    <layer name="ScaleShift_stage3_unit3_bn1" type="ScaleShift" id="81" precision="FP32">
      <input>
        <port id="170">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="169">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights size="4096" offset="16266264"/>
      <biases size="4096" offset="16270360"/>
    </layer>
    <layer name="ReLU_stage3_unit3_relu1" type="ReLU" id="82" precision="FP32">
      <input>
        <port id="172">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="171">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage3_unit3_conv1" type="Convolution" id="83" precision="FP32">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="256" group="1" dilation-x="1" dilation-y="1"/>
      <input>
        <port id="174">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="173">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights size="1048576" offset="16274456"/>
      <biases size="1024" offset="17323032"/>
    </layer>
    <layer name="ReLU_stage3_unit3_relu2" type="ReLU" id="84" precision="FP32">
      <input>
        <port id="176">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="175">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage3_unit3_conv2" type="Convolution" id="85" precision="FP32">
      <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="256" group="1" dilation-x="1" dilation-y="1"/>
      <input>
        <port id="178">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="177">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights size="2359296" offset="17324056"/>
      <biases size="1024" offset="19683352"/>
    </layer>
    <layer name="ReLU_stage3_unit3_relu3" type="ReLU" id="86" precision="FP32">
      <input>
        <port id="180">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="179">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage3_unit3_conv3" type="Convolution" id="87" precision="FP32">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="1024" group="1" dilation-x="1" dilation-y="1"/>
      <input>
        <port id="182">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="181">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights size="1048576" offset="19684376"/>
    </layer>
    <layer name="Eltwise__plus9" type="Eltwise" id="88" precision="FP32">
      <elementwise_data operation="sum"/>
      <input>
        <port id="184">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
        <port id="185">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="183">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
    </layer>
    <layer name="ScaleShift_stage3_unit4_bn1" type="ScaleShift" id="89" precision="FP32">
      <input>
        <port id="187">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="186">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights size="4096" offset="20732952"/>
      <biases size="4096" offset="20737048"/>
    </layer>
    <layer name="ReLU_stage3_unit4_relu1" type="ReLU" id="90" precision="FP32">
      <input>
        <port id="189">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="188">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage3_unit4_conv1" type="Convolution" id="91" precision="FP32">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="256" group="1" dilation-x="1" dilation-y="1"/>
      <input>
        <port id="191">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="190">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights size="1048576" offset="20741144"/>
      <biases size="1024" offset="21789720"/>
    </layer>
    <layer name="ReLU_stage3_unit4_relu2" type="ReLU" id="92" precision="FP32">
      <input>
        <port id="193">
          <dim>1</dim>
